---
type: ExportLinetypeKey
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ExportLinetypeKey

`Autodesk.Revit.DB.ExportLinetypeKey` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportLinetypeKey | — | `` |
| Constructor | ExportLinetypeKey | 2014 | `public ExportLinetypeKey ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OriginalLinetypeName | 2014 | `public string OriginalLinetypeName { get ; set ; }` |